# Вариант 1.
def var_1():
    print(print('Это', input('Вид питомца: ').lower(), 'по кличке', input('Имя питомца: ') + '.', 'Возраст -', input('Возраст питомца: '), 'лет.'))


# Вариант 2.

def var_2():
    name = input('Кличка питомца: ') + '.'
    type = input('Вид питомца: ').lower()
    old = input('Возраст питомца: ')
    x = ''
    if old == ('1', '21', '31'):
        x = 'год.'
    elif old in ('2', '3', '4'):
        x = 'года.'
    elif old in ('5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '25', '26', '27', '28', '29', '30'):
        x = 'лет.'
    print('Это', type, 'по кличке', name, 'Возраст -', old, x)

#  var_1()
#  var_2()
