print('Приветственное сообщение.')

dict = {
    "name": input('Введите имя питомца: '),
    "type": input('Введите вид питомца: '),
    "old": int(input('Введите возраст питомца: ')),
    "master_name": input('Введите имя хозяина питомца: ')
}

if dict["old"] == (1, 21, 31):
    x = 'год.'
elif dict["old"] in (2, 3, 4, 22, 23, 24):
    x = 'года.'
elif dict["old"] in (
5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 25, 26, 27, 28, 29, 30):
    x = 'лет.'

print("Это", dict["type"].lower(), "по кличке", dict["name"] + ".", "Возраст питомца:", dict["old"], x, "Имя владельца:", dict["master_name"] + ".")
